Revit 2024 API
BuiltInFailures.BeamSystemFailures.BeamSystemTagBadView Property
 Beam System Tags can only be placed in plan , elevation and 3D views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BeamSystemTagBadView { get; }
Visual Basic
Public Shared ReadOnly Property BeamSystemTagBadView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BeamSystemTagBadView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BeamSystemFailures Class
Autodesk.Revit.DB Namespace